project/src/Catalogs/СоставыКонвертаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>СоставыКонвертаций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Конвертации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭлементКонвертации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаКонвертацииПредопределенныхДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаКонвертацииОбъектов</v8:Type>
						<v8:Type>cfg:CatalogRef.Алгоритмы</v8:Type>
						<v8:Type>cfg:CatalogRef.Запросы</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбработкиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/CommonForms/ВопросВхождениеВСоставКонвертаций/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Параметры.ЭлементКонвертации)
		ИЛИ Параметры.СписокКонвертаций.Количество() < 2 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ЭлементКонвертации = Параметры.ЭлементКонвертации;
	Для Каждого ЭлементСписка Из Параметры.СписокКонвертаций Цикл
		Конвертации.Добавить(ЭлементСписка.Значение,,Истина);
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОК(Команда)
	
	ВыбранныеКонвертации = Новый СписокЗначений;
	Для Каждого ЭлементСписка Из Конвертации Цикл
		Если ЭлементСписка.Пометка Тогда
			ВыбранныеКонвертации.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если ВыбранныеКонвертации.Количество() < Конвертации.Количество() Тогда
		ОКНаСервере();
		ОповеститьОВыборе(ВыбранныеКонвертации);
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
	
	// Создаем копию элемента до изменения.
	ЭлементКонвертацииОбъект = ЭлементКонвертации.Скопировать();
	ЭлементКонвертацииОбъект.Записать(); 
	
	// Если это ПКО то копируем состав ПКС
	Если ТипЗнч(ЭлементКонвертации.Ссылка) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда 
		СкопироватьПКС(ЭлементКонвертацииОбъект.Ссылка, ЭлементКонвертации.Ссылка);
	КонецЕсли;
	
	// Корректируем состав конвертации.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоставыКонвертаций.Владелец КАК Конвертация,
	|	СоставыКонвертаций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СоставыКонвертаций КАК СоставыКонвертаций
	|ГДЕ
	|	СоставыКонвертаций.ЭлементКонвертации = &ЭлементКонвертации
	|	И НЕ СоставыКонвертаций.ПометкаУдаления
	|	И НЕ СоставыКонвертаций.Отключить";
	Запрос.УстановитьПараметр("ЭлементКонвертации", ЭлементКонвертации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		РезультатПоиска = Конвертации.НайтиПоЗначению(Выборка.Конвертация);
		Если РезультатПоиска = Неопределено Тогда
			// Страховочная проверка. Такого не должно быть.
			Продолжить;
		Иначе
			Если РезультатПоиска.Пометка Тогда
				// Оставляем в текущем состоянии.
				Продолжить;
			Иначе
				СоставКонвертацийОбъект = Выборка.Ссылка.ПолучитьОбъект();
				СоставКонвертацийОбъект.ЭлементКонвертации = ЭлементКонвертацииОбъект.Ссылка;
				СоставКонвертацийОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

Процедура СкопироватьПКС(НовоеПравило, ИсходноеПравило) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Ссылка,
	|	Родитель,
	|	ЭтоГруппа
	|ИЗ Справочник.ПравилаКонвертацииСвойств
	|ГДЕ Владелец = &Владелец И НЕ ПометкаУдаления";
	Запрос.УстановитьПараметр("Владелец", ИсходноеПравило);
	ТабПКС = Запрос.Выполнить().Выгрузить(); 
	СоответствиеГрупп = Новый Соответствие;
	Для НомерПрохода = 1 По 2 Цикл
		// В первый проход обрабатываются группы, во второй элементы.	
		Для Каждого СтрокаПКС Из ТабПКС Цикл
			Если НомерПрохода = 1 Тогда
				Если НЕ СтрокаПКС.ЭтоГруппа Тогда
					Продолжить;
				КонецЕсли;
			ИначеЕсли НомерПрохода = 2 Тогда
				Если СтрокаПКС.ЭтоГруппа Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;

			// Для ПКО подчиненные ПКС копируются.
			ДубльПКС = СтрокаПКС.Ссылка.Скопировать();
			ДубльПКС.Владелец = НовоеПравило;
			Если ЗначениеЗаполнено(СтрокаПКС.Родитель) Тогда
				ДубльПКС.Родитель = СоответствиеГрупп.Получить(СтрокаПКС.Родитель);
			КонецЕсли;
			ДубльПКС.ОбменДанными.Загрузка = Истина;
			ДубльПКС.Записать();
			Если СтрокаПКС.ЭтоГруппа Тогда
				СоответствиеГрупп.Вставить(СтрокаПКС.Ссылка, ДубльПКС.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти
